__[Open and try this file online (Colab)](https://colab.research.google.com/github/djekra/pandasklar/blob/master/jupyter/23_Let_DataFrames_Interact.ipynb)__

# Let DataFrames Interact
* `isin`: isin over several columns. Returns a mask for df1: The rows of df1 that match the ones in df2 in the specified columns.
* `update_col`:     Transfers one column of data from one dataframe to another dataframe.<br>
   Unlike a simple merge, the index and the dtypes are retained. Handles dups and conditions. Verbose if wanted.

In [1]:
# blab init
try:
    import blab
except ImportError as e:
    !pip install blab
    import blab    
startup_notebook = blab.blab_startup()
%run $startup_notebook

blab init
environment['in_colab']     = False
environment['dropbox_path'] = /home/me/Data_Linux/Dropbox
environment['lib_path']     = /home/me/Data_Linux/Dropbox/31_Projekte/01_Python/libs
Start Time: 22:15:09

In [2]:
import pandas     as pd 
import bpyth      as bpy

# pandasklar
try:
    import pandasklar as pak 
except ImportError as e:
    !pip install pandasklar
    import pandasklar as pak   
    
# verbose
pak.Config.set('VERBOSE', True)

# copy_on_write
pd.set_option("mode.copy_on_write", True)

VERBOSE = True
--> setting verbose=True as default for all pandasklar functions

## isin
over several columns

In [3]:
?pak.isin

Signature: pak.isin(df1, df2, on=[], left_on=[], right_on=[])
Docstring:
isin over several columns.
Returns a mask for df1: The rows of df1 that match the ones in df2 in the specified columns.
File:      ~/Data_Linux/Dropbox/31_Projekte/01_Python/git/pandasklar/src/pandasklar/pandas.py
Type:      function

In [4]:
df1 = pak.dataframe( [ list('Zugzwang'),  # 'Zu'  
                       list('Wurmloch'), 
                       list('Witzbold'), 
                       list('Heuernte'), 
                       list('Halbgott'),  # 'Ha' 
                       list('Halbzeit'),  # 'Ha' 
                       list('Hausfrau'),  # 'Ha'       
                       list('Hebelarm'),                     
                ] )

df2 = pak.dataframe( [ list('Babykorb'), 
                       list('abfällig'), 
                       list('Abgründe'), 
                       list('Kätzchen'), 
                       list('Landwirt'), 
                       list('Handkuss'),  # 'Ha'
                       list('Saugrohr'),       
                       list('Zuzügler'),  # 'Zu'                   
                ] )

df2

Input rtype=('list', 'list', 'str') shape=(8, 8)
rotated=False Output rtype=('DataFrame', 'Series') shape=(8, 8)
Input rtype=('list', 'list', 'str') shape=(8, 8)
rotated=False Output rtype=('DataFrame', 'Series') shape=(8, 8)

   A  B  C  D  E  F  G  H
0  B  a  b  y  k  o  r  b
1  a  b  f  ä  l  l  i  g
2  A  b  g  r  ü  n  d  e
3  K  ä  t  z  c  h  e  n
4  L  a  n  d  w  i  r  t
5  H  a  n  d  k  u  s  s
6  S  a  u  g  r  o  h  r
7  Z  u  z  ü  g  l  e  r

In [5]:
mask = pak.isin(df1, df2, on=['A','B'])
df1[mask]

   A  B  C  D  E  F  G  H
0  Z  u  g  z  w  a  n  g
4  H  a  l  b  g  o  t  t
5  H  a  l  b  z  e  i  t
6  H  a  u  s  f  r  a  u

In [6]:
mask = ~pak.isin(df1, df2, on=['A','B'])
df1[mask]

   A  B  C  D  E  F  G  H
1  W  u  r  m  l  o  c  h
2  W  i  t  z  b  o  l  d
3  H  e  u  e  r  n  t  e
7  H  e  b  e  l  a  r  m

## update_col

In [7]:
?pak.update_col

Signature:
pak.update_col(
    df_to,
    df_from,
    on=[],
    left_on=[],
    right_on=[],
    col='',
    col_rename='',
    col_score='',
    func='',
    cond='',
    keep='',
    return_mask=False,
    verbose=None,
)
Docstring:
Transfers one column of data from one dataframe to another dataframe.
Unlike a simple merge, the index and the dtypes are retained.
Handles dups and conditions. Verbose if wanted.

df_to:        Dataframe to be changed
df_from:      Dataframe that contains the new data. Does not have to be duplicate-free.
on:           Column name or list of column names whose values must match
left_on:      Different for left and right if necessary
right_on:     Different for left and right if necessary
col:          Name of the column to be transmitted. Must exist in df_from.
              If not present in df_to, it will be appended.
              If already present, matching values will be overwritten.
col_rename:   New name for col, if specified. If already present, matching values will be overwritten and not matching values are preserved.
col_score:     Name of a score column used for picking rows from df_from with maximum score. This is useful to avoid conflicting values in case of dups in df_from.
              If empty: No dup avoidance by rank.
func:         Name of the function used for dup avoidance. E.g. 'max'. If empty: No dup avoidance by func.
              Might be slow, use col_score if possible.
cond:         Empty, 'min','max' or 'null'.
              'min','max': Only write if the new value is smaller / larger than the existing value
              'null'     : Only write if there is no existing value in df_to (it's Null or empty string)
keep:         Should the original value be kept in a separate column?
              The string keep is used as suffix for this column.
              NaN if record is unchanged!
return_mask:  If True, the result is a tuple of the resulting dataframe plus a mask masking the affected rows
verbose:    Messages on / off
File:      ~/Data_Linux/Dropbox/31_Projekte/01_Python/git/pandasklar/src/pandasklar/pandas.py
Type:      function

In [8]:
# create test data
df = pak.people()
df = pak.drop_cols(df,['history'])
df

,first_name,age,age_class,postal_code,birthplace,secret,features
0,Else,20,20,67003,<NA>,vVwpCÜL4Gd,"{R, H, b}"
1,Bernhard,27,20,54349,Berlin,vpe70x,"{O, p}"
2,Maurice,40,40,82919,<NA>,üAKoRDVs5,"{3, v, 5, J}"
3,Anja,29,20,16468,Bremen,sLxou8G,{d}
4,Hugo,24,20,50482,Bremen,eäYh8Äuz4s,"{w, d, 4}"
...,...,...,...,...,...,...,...
95,Artur,23,20,25492,Berlin,mbGiH,"{x, V, X}"
96,Gustav,30,30,88440,Berlin,eeecHDxUVw,"{0, K, 3, c}"
97,Jannis,29,20,82736,Bremen,oGW834vckW,"{U, L, j, g}"
98,Karin,34,30,31666,Berlin,JiB9vLD,{V}
99,Karin,25,20,46915,<NA>,MÜWä1gJwA,"{z, M}"

In [9]:
# create df_from
# we want to transfer data from df_from to df
df_from = df.head(20).copy()
for c in ['birthplace', 'features']:
    df_from[c] = '##' + df_from[c].astype(str) + '##'
for c in ['age','age_class','postal_code']:
    df_from[c] = -df_from[c]    
df_from.head(3)

,first_name,age,age_class,postal_code,birthplace,secret,features
0,Else,-20,-20,-67003,##<NA>##,vVwpCÜL4Gd,"##{'R', 'H', 'b'}##"
1,Bernhard,-27,-20,-54349,##Berlin##,vpe70x,"##{'O', 'p'}##"
2,Maurice,-40,-40,-82919,##<NA>##,üAKoRDVs5,"##{'3', 'v', '5', 'J'}##"

In [10]:
# Transfer features data. Use first_name and secret as identifier.
df = pak.update_col(df, df_from, on=['first_name','secret'], col='features')
df

update_col: 20 cells written into existing column

,first_name,age,age_class,postal_code,birthplace,secret,features
0,Else,20,20,67003,<NA>,vVwpCÜL4Gd,"##{'R', 'H', 'b'}##"
1,Bernhard,27,20,54349,Berlin,vpe70x,"##{'O', 'p'}##"
2,Maurice,40,40,82919,<NA>,üAKoRDVs5,"##{'3', 'v', '5', 'J'}##"
3,Anja,29,20,16468,Bremen,sLxou8G,##{'d'}##
4,Hugo,24,20,50482,Bremen,eäYh8Äuz4s,"##{'w', 'd', '4'}##"
...,...,...,...,...,...,...,...
95,Artur,23,20,25492,Berlin,mbGiH,"{x, V, X}"
96,Gustav,30,30,88440,Berlin,eeecHDxUVw,"{0, K, 3, c}"
97,Jannis,29,20,82736,Bremen,oGW834vckW,"{U, L, j, g}"
98,Karin,34,30,31666,Berlin,JiB9vLD,{V}
99,Karin,25,20,46915,<NA>,MÜWä1gJwA,"{z, M}"

In [11]:
# Transfer age data. Use age_class as idenitfier.
df = pak.update_col(df, df_from, on=['first_name','secret'], col='age', keep='_old')

update_col: 20 cells written into existing column

In [12]:
# have a look
mask = df.age < 0
a = df[ mask].head(10)
b = df[~mask].head(10)
pd.concat([a,b])

,first_name,age,age_class,postal_code,birthplace,secret,features,age_old
0,Else,-20,20,67003,<NA>,vVwpCÜL4Gd,"##{'R', 'H', 'b'}##",20
1,Bernhard,-27,20,54349,Berlin,vpe70x,"##{'O', 'p'}##",27
2,Maurice,-40,40,82919,<NA>,üAKoRDVs5,"##{'3', 'v', '5', 'J'}##",40
3,Anja,-29,20,16468,Bremen,sLxou8G,##{'d'}##,29
4,Hugo,-24,20,50482,Bremen,eäYh8Äuz4s,"##{'w', 'd', '4'}##",24
5,Hendrik,-36,30,87031,<NA>,PÜeZfBS,"##{'x', 's', 'e', 'D'}##",36
6,Arne,-34,30,23331,Bremen,iW1RF,"##{'l', 'd', 'U'}##",34
7,Karin,-29,20,35416,<NA>,ZLrqFOb,"##{'r', 'M', 'i', 'j'}##",29
8,Robert,-31,30,46915,Berlin,GKdt2ÖZs,"##{'4', 'D'}##",31
9,Sarah,-37,30,21014,Bremen,z845käo,##{'K'}##,37
20,Marina,25,20,96551,Bremen,üzf2iüH,"{U, L, j, g}",<NA>
21,Toni,27,20,65384,Bremen,j2yoksÜ,"{f, O, k, q}",<NA>
22,Herbert,34,30,11701,<NA>,oKC5aTYi,"{2, k}",<NA>
23,Ruth,29,20,55506,Bremen,iLQulr,{l},<NA>
24,Fynn,27,20,11791,Bremen,knDhLäbZ1,"{3, T, Y, H}",<NA>
25,Tanja,40,40,31666,<NA>,vAkulkPGP,"{O, x, v, a}",<NA>
26,Tom,24,20,92306,Berlin,äüö3Ä,"{3, 5, h}",<NA>
27,Luis,33,30,97248,Berlin,PäyömsläfZ,{a},<NA>
28,Amelie,30,30,97153,Berlin,ÖDvuaK,"{A, l}",<NA>
29,Christian,36,30,<NA>,Bremen,c8LUWQn,"{4, x, e, X}",<NA>

### conflicting rows

In [35]:
# create another df_from
# this time with conflicting rows
i = pak.random_series( 100, 'int', min=20, max=40, name='age'      )
j = pak.random_series( 100, 'int', min=1000, max=2000, name='age_special'  )
k = pak.random_series( 100, 'float', name='score'  )
df_from = pak.dataframe([i,j,k]).sort_values(['age','age_special'])
mask = df_from.duplicated(subset='age',keep=False)
df_from = pak.reset_index(df_from[mask]).head(10)
df_from

Input rtype=('list', 'Series', 'int') shape=(3, 100)
rotated=True Output rtype=('DataFrame', 'Series') shape=(100, 3)

   age  age_special  score
0   21         1118  0.911
1   21         1213  0.703
2   21         1344  0.644
3   21         1743  0.858
4   21         1913  0.770
5   22         1099  0.234
6   22         1291  0.506
7   23         1142  0.204
8   23         1160  0.303
9   23         1330  0.763

In [39]:
# Transfer data. Use age as identifier.
# But age is not unique in df_from.
# func='max' writes the maximum value.
r = pak.update_col(df, df_from, on='age', col='age_special', func='max')

# display
r = r.sort_values(['age','age_special'])
mask = r.age_special.notnull()
spalten = ['first_name','age','age_special']
r[mask][spalten]

update_col: func max applied, 7 records less!
update_col: 6 cells written into new column

   first_name  age  age_special
59      Peter   21       1913.0
35    Wilhelm   22       1291.0
31      Linus   23       1330.0
45     Dagmar   23       1330.0
63      Marko   23       1330.0
95      Artur   23       1330.0

In [40]:
# func='min' writes the minimum value.
r = pak.update_col(df, df_from, on='age', col='age_special', func='min')

# display
r = r.sort_values(['age','age_special'])
mask = r.age_special.notnull()
spalten = ['first_name','age','age_special']
r[mask][spalten]

update_col: func min applied, 7 records less!
update_col: 6 cells written into new column

   first_name  age  age_special
59      Peter   21       1118.0
35    Wilhelm   22       1099.0
31      Linus   23       1142.0
45     Dagmar   23       1142.0
63      Marko   23       1142.0
95      Artur   23       1142.0

In [42]:
# col_score selects the rows with maximum score
r = pak.update_col(df, df_from, on='age', col='age_special', col_score='score')

# display
r = r.sort_values(['age','age_special'])
mask = r.age_special.notnull()
spalten = ['first_name','age','age_special']
r[mask][spalten]

update_col: col_score score applied, 7 records less!
update_col: 6 cells written into new column

   first_name  age  age_special
59      Peter   21       1118.0
35    Wilhelm   22       1291.0
31      Linus   23       1330.0
45     Dagmar   23       1330.0
63      Marko   23       1330.0
95      Artur   23       1330.0